[
  {
    "title": "一个集成化的软件工程支撑环境",
    "authors": [
      "杨芙清",
      "方裕",
      "唐世渭",
      "杨冬青"
    ],
    "publish_time": "1991, 2(2):1-8.",
    "abstract": "软件工程支撑环境的集成化问题是构造环境的中心环节,它涉及到概念、方法、技术和工具等方面,有其内在的逻辑含义和物理表征。本文介绍了一个在UNIX系统上构造的集成化的软件工程支撑环境。该环境以环境库和用户界面为其主要的集成机制,支持面向对象的程序设计方法。它提供了一个基本语言序列,可以支持不同层次的用户从事软件开发活动和项目管理活动。在实现上,采用分层虚机器的构造方法,从而保证了系统的坚固性、开放性和可剪裁性。"
  },
  {
    "title": "软件工程CASE工具——RSL/RSA",
    "authors": [
      "许龙山",
      "贾霖"
    ],
    "publish_time": "1993, 4(6):29-35.",
    "abstract": "软件的发展经历了若干阶段,到今天已进入了软件工程时代,软件工程将系统开发分为几个阶段,其中需求定义与分析阶段的技术和方法已成为软件工程时代所要解决的主要课题之一。需求分析的关键技术是需求定义与分析的质量问题,“需求规格说明语言/需求规格说明分析系统”(RSL/RSA)是一种以规格说明为核心,以需求规格说明数据库为基础的计算机辅助需求分析系统,本文从软件工程的角度,提出了需求分析的关键技术、集 成化的软件工具包的概念和RSL/RSA系统的设计目标,同时介绍了计算机辅助需求工程工具RSI/RSA系统的功能、结"
  },
  {
    "title": "专家系统的软件工程建造方法",
    "authors": [
      "刘群",
      "黄厚宽",
      "于之硕"
    ],
    "publish_time": "1994, 5(6):51-57.",
    "keywords": [
      "专家系统",
      "软件工程"
    ],
    "abstract": "本文指出ＥＳ所固有的一些困难引起了ＥＳ的设计和维护上的困难，提出了ＥＳ的软件工程方法的观点、描述认知过程的知识说明和建造ＥＳ过程的ＰＬＷＦ模型，用来解决ＥＳ的设计阶段和维护阶段产生的问题。"
  },
  {
    "title": "一种面向软件工程的时序逻辑语言",
    "authors": [
      "唐稚松",
      "赵琛"
    ],
    "publish_time": "1994, 5(12):1-16.",
    "keywords": [
      "时序逻辑语言，一阶逻辑，描述，验证，证明规则，Hoare逻辑，状态转换，变换，并发性，通信进程，实时，分布式系统，通道，动态束定，同步，并行语句，选择语句，CASE工具"
    ],
    "abstract": "ＸＹＺ系统由时序逻辑语言ＸＹＺ／Ｅ及一组基于该语言的ＣＡＳＥ工具集组成．ＸＹＺ／Ｅ语言的目的是欲使逐步求精，描述及验证、快速原型等一些软件工程方法更加有效．特别地，它还能表示实时通信进程中的动态成分．在统一的框架下，不仅能表示不同层次的抽象描述，而且能表示普通高级语言的各种重要性质．本文是关于这一时序逻辑语言最新、最完整的介绍．"
  },
  {
    "title": "从软件工程的发展看软件自动化*",
    "authors": [
      "白光野",
      "徐崇",
      "范植华",
      "蒋东溟"
    ],
    "publish_time": "1995, 6(zk):292-300.",
    "keywords": [
      "软件工程，面向对象，软件自动化．"
    ],
    "abstract": "本文对软件工程方法学发展各个阶段主要的方法论做了简单的评述，并展望了软件工程今后发展的方向，同时举例说明了以此为指导思想进行软件自动构造的方法．"
  },
  {
    "title": "软件工程技术发展思索",
    "authors": [
      "杨芙清"
    ],
    "publish_time": "2005, 16(1):1-7.",
    "keywords": [
      "软件工程"
    ],
    "abstract": "在4个方面对软件工程技术的发展进行一些思索:(1) 从事物发展规律的角度,揭示软件工程技术发展历程;(2) 从软件本质特征的角度,浅析虚拟机各抽象层次的构造;(3) 从软件开发的本质,提出了软件工程学科研究的内容,并研究了软件工业化生产模式;(4) 以Internet的出现为背景,探索了软件技术的发展趋势."
  },
  {
    "title": "基于搜索的软件工程研究专题前言",
    "authors": [
      "李征",
      "巩敦卫",
      "聂长海",
      "江贺"
    ],
    "publish_time": "2016, 27(4):769-770.",
    "abstract": "软件工程自从1968年提出以来,一直是提高软件开发效率、保障软件质量的有效手段.软件的发展及内涵被归纳为三个空间:平台空间、认知空间和问题空间,相应的,软件工程发展也从传统的模式化转向知识化和智能化.基于搜索的软件工程(Search Based Software Engineering, SBSE)是传统软件工程和智能计算(Intelligent Computing)交叉的新兴研究领域,从问题的解空间出发,采用智能计算领域的元启发式搜索优化算法解决软件工程相关问题,能够实现自动化和智能化.基于搜索的软件工程被2007年度IEEE国际软件工程大会(ICSE)确立为软件工程的发展方向之一,到目前为止已经在软件测试数据自动生成、程序错误自动修复等方面取得显著的研究成果,有效地促进了软件工程学科的发展.本专刊选题为“基于搜索的软件工程研究”,反映我国学者在这个领域的部分近期研究成果.专刊公开征文历经两轮,共征得投稿28篇.此外,专刊组稿与第四届中国基于搜索的软件工程研讨会(CSBSE2015)和第十四届全国软件与应用学术会议(NASAC2015)合作,邀请CSBSE2015会议投稿中的高质量的论文作为第一轮投稿,并面向全国高校、科研院所等广泛征集第二轮投稿.上述稿件涉及软件测试、错误定位、软件产品线和云计算构件优化等诸多方面的研究内容.特约编辑先后邀请了40余位软件工程和智能计算相关领域的专家参与审稿工作,每篇投稿邀请2位专家进行评审.稿件评审历经6个月,经初审、复审、NASAC 2015会议宣读和终审各个阶段,最终有12篇论文入选本专刊."
  },
  {
    "title": "大数据时代软件工程专题前言",
    "authors": [
      "刘璘",
      "周明辉",
      "尹刚"
    ],
    "publish_time": "2017, 28(6):1327-1329.",
    "abstract": "软件在人类社会生活中发挥着越来越重要的作用,软件工程研究软件系统构造、开发、运行、维护、演化的创新方法以提高效率和质量.从上世纪五六十年代起,软件工程经历了从结构化、到面向对象、到网络服务化的演进.软件工程研究内容和范围不断扩展,其应用和实践也不断延伸,正发展成为结合人工智能、社会计算、认知科学、数据科学与工程等多学科交叉的领域.为及时反映我国学者在结合大数据技术的软件工程研究新进展,以及在大数据软件应用的开发方面的最新实践经验,“大数据时代的软件工程”专题围绕上述新兴热点问题,同时也兼顾经典问题的最新突破,征集本领域近期取得的原创性研究成果.专题的征文范围包括（但并不限于）面向特定领域的大数据应用开发、调试、部署及运行管理过程中的软件工程问题、软件工程数据质量问题、面向开源软件生态系统的数据分析、软件生命周期中的数据采集与分析、大规模群体协同的软件开发方法与平台环境、面向软件系统创新与产品线演化的模型、理论与工具、面向特定领域的大数据应用需求分析、用户行为数据收集与系统可用性分析、软件数据分析的代价与价值评估.专题公开征文,共征得投稿22篇.特约编辑邀请了国内外在该领域有影响力的一组学者参与审稿工作,每篇投稿至少邀请2位专家进行初审.大部分稿件经过初审和复审两轮评审,部分稿件经过了两轮复审.通过初审的稿件还在NASAC 2016大会上进行了现场报告,作者现场回答了听众的问题,并听取了听众的修改建议.最终有13篇论文入选本专题.入选论文覆盖开源软件生态分析、软件分类检测与推荐、软件故障与缺陷预测、面向领域的大数据应用开发方法."
  },
  {
    "title": "对软件工程中经验研究的调查",
    "authors": [
      "张莉",
      "蒲梦媛",
      "刘奕君",
      "田家豪",
      "岳涛",
      "蒋竞"
    ],
    "publish_time": "2018, 29(5):1422-1450.",
    "keywords": [
      "经验方法"
    ],
    "abstract": "为了描述、理解、评估、预测、控制、管理或者改善与软件相关的内容，研究者常常使用经验研究的方法.经验研究在软件工程领域已经得到广泛的应用并备受关注.为了了解近年来软件工程中经验研究的特点，并希望经验研究方法为更多研究者所了解，通过系统映射的方法，对软件工程中经验研究的典型期刊《Empirical Software Engineering》（ESE）近5年的论文做了调研，搜集了2013年1月~2017年6月发表在该期刊的250篇论文.通过定性和定量的分析，给出了软件工程领域采用经验研究的主要目的、常用的经验研究方法以及这些方法在软件工程各个领域中的使用情况和呈现的一些新特征.之后，分析了经验研究的主要数据来源、采集手段、常用的数理统计方法以及开源项目在经验研究中的使用情况等，给出了研究者对有效性和可重现性问题的关心程度.最后进行了有效性分析，并进一步探讨了经验研究的发展方向和大数据时代下经验研究面临的机遇和一些开放性问题."
  },
  {
    "title": "面向DevOps的软件工程新技术专题前言",
    "authors": [
      "荣国平",
      "白晓颖",
      "岳涛"
    ],
    "publish_time": "2019, 30(10):3054-3055."
  },
  {
    "title": "面向持续软件工程的微服务架构技术专题前言",
    "authors": [
      "张贺，王忠杰，陈连平，彭鑫"
    ],
    "publish_time": "2021, 32(5):1229-1230.",
    "abstract": "随着软件互联网化和服务化的高度发展,持续性(continuity)成为现代软件系统的基本特性之一,覆盖从商业策划、软件开发、运维、演化的所有环节,使得软件系统在持续稳定提供功能和服务的同时,软件系统的边界和内部结构始终处于不断变化、持续更新和适应之中,持续软件工程(continuous software engineering)由此被提出并迅速得到广泛的实践应用.微服务(microservice)架构作为一种全新的去中心化分布式架构,在软件架构层面成为适应持续软件工程发展的必然趋势,而领域驱动设计(domain-driven design,简称DDD)伴随着微服务架构的兴起也重新获得了业界的广泛关注,二者共同关注服务自顶向下的合理设计和分解.微服务架构与领域驱动设计共同支持实现现代软件系统的持续性特征.为了反映中国学者和实践者在求解以微服务架构为代表的持续软件工程所面临的架构难题和挑战过程中取得的理论、技术或实验方面的创新性、突破性的高水平研究成果,特设立此专题.本专题采取公开征稿的方式,共收到19篇投稿并通过了形式审查.特约编辑邀请了20余位领域专家参与审稿,每篇稿件至少邀请2位评审专家并经过两轮审稿.共计10篇稿件通过第1轮评审,并在CCF中国软件大会上进行了报告.经过第2轮终审,最终有6篇论文入选本专题.其中,论文“基于混沌工程的微服务韧性风险识别和分析”研究微服务架构系统的韧性风险识别问题,通过向系统引入随机环境扰动并观察服务性能的变化来寻找潜在韧性风险,向运维人员提供参考.论文“面向微服务架构的开发组织适应性评估框架”通过系统化文献综述得出了使用微服务架构对组织产生的7个方面的影响,进一步提出了一个用于评估并提高开发组织对于微服务架构的适应性的评估框架.论文“一种优化的数据流驱动的微服务化拆分方法”提出了一种自动化的微服务拆分与评估方法DFD-A,支持从数据收集分析、服务拆分到候选微服务架构评估的自动化设计过程,并实现了原型工具.论文“一种监控系统的链路跟踪型日志数据的存储设计”基于开源的应用性能监控系统CAT,提出了一种针对tracing类型日志数据的存储设计方案,提升了存储效率和查询效率,并在美团点评线上系统中得到真实 应用.论文“基于多源特征空间的微服务可维护性评估”提出了一种多源特征空间模型以统一表示软件维护过程中产生的多源数据.基于该模型提出了微服务代码可维护性度量,并实现了原型工具MicroEvaluator.论文“多版本共存的微服务系统自适应演化方法”针对微服务系统中的多版本共存现象和用户/运维需求的变化,提出了最优化微服务系统演化方案的设计方法,实现了相应的编程框架以支持微服务系统自适应演化.本专题面向持续软件工程和微服务架构的研究人员和工程实践人员,内容涵盖系统软件、软件工程等领域,反映了我国学者在以微服务架构为代表的持续软件工程方法、技术以及支持工具等方面的高水平研究成果.感谢《软件学报》编委会、中国计算机学会软件工程专委会与系统软件{
  "title": "面向软件工程的情感分析技术研究",
  "authors": [
    "陈震鹏，姚惠涵，曹雁彬，刘譞哲，梅宏"
  ],
  "publish_time": "2023, 34(5):2218-2230.",
  "keywords": [
    "情感分析"
  ],
  "abstract": "情感分析在软件工程领域具有广泛的应用场景，例如，从代码提交信息中检测开发者的情绪、从程序员问答论坛中识别开发者的观点等.但是，现有的“开箱即用”的情感分析工具无法在软件工程相关的任务中取得可靠的结果.已有研究表明，导致不可靠结果的最主要原因是，这些工具无法理解一些单词和短语在软件工程领域中的特定含义.此后，研究者们开始为软件工程领域定制监督学习和远程监督学习方法.为了验证这些方法的效果，研究者们使用软件工程相关的标注数据集来对它们进行数据集内验证，即，将同一数据集划分为训练集和测试集，分别用于方法的训练和测试.但是，对软件工程领域的某些情感分析任务来说，尚无标注数据集，且人工标注数据集耗时耗力.在此情况下，一种可选的方法就是使用为了相似任务从同一目标平台上提取的数据集或者使用从其他软件工程平台上提取的数据集.为了验证这两种做法的可行性，需要进一步以平台内设置和跨平台设置来验证现有情感分析方法.平台内设置指的是使用提取自同一平台的不同数据集作为训练集和测试集；跨平台设置指的是使用提取自不同平台的数据集作为训练集和测试集.目标旨在数据集内设置、平台内设置、跨平台设置这3种设置下，综合验证现有的为软件工程定制的情感分析方法.最终，实验结果为相关的研究者和从业者提供了具有现实指导意义的启示."
},
{
  "title": "领域软件工程专题前言",
  "authors": [
    "汤恩义，江贺，陈俊洁，李必信，唐滨"
  ],
  "publish_time": "2022, 33(5):1527-1528.",
  "keywords": [
    "1527"
  ],
  "abstract": ""
},
{
  "title": "预训练模型在软件工程领域应用研究进展",
  "authors": [
    "宫丽娜，周易人，乔羽，姜淑娟，魏明强，黄志球"
  ],
  "publish_time": "2025, 36(1):1-26.",
  "keywords": [
    "软件仓库挖掘"
  ],
  "abstract": "近年来深度学习在软件工程领域任务中取得了优异的性能. 众所周知, 实际任务中优异性能依赖于大规模训练集, 而收集和标记大规模训练集需要耗费大量资源和成本, 这限制了深度学习技术在实际任务中的广泛应用. 随着深度学习领域预训练模型(pre-trained model, PTM)的发布, 将预训练模型引入到软件工程(software engineering, SE)任务中得到了国内外软件工程领域研究人员的广泛关注, 并得到了质的飞跃, 使得智能化软件工程进入了一个新时代. 然而, 目前没有研究提炼预训练模型在软件工程领域的成功和机遇. 为阐明这一交叉领域的工作 (pre-trained models for software engineering, PTM4SE), 系统梳理当前基于预训练模型的智能软件工程相关工作, 首先给出基于预训练模型的智能软件工程方法框架, 其次分析讨论软件工程领域常用的预训练模型技术, 详细介绍使用预训练模型的软件工程领域下游任务, 并比较和分析预训练模型技术这些任务上的性能. 然后详细介绍常用的训练和微调PTM的软件工程领域数据集. 最后, 讨论软件工程领域使用PTM面临的挑战和机遇. 同时将整理的软件工程领域PTM和常用数据集发布在https://github.com/OpenSELab/PTM4SE."
},
{
  "title": "从软件工程的发展看软件自动化*",
  "authors": [
    "白光野",
    "徐崇",
    "范植华",
    "蒋东溟"
  ],
  "publish_time": "1995, 6:292-300.",
  "keywords": [
    "软件工程，面向对象，软件自动化．"
  ],
  "abstract": "本文对软件工程方法学发展各个阶段主要的方法论做了简单的评述，并展望了软件工程今后发展的方向，同时举例说明了以此为指导思想进行软件自动构造的方法．"
}
]
    "publish_time": "1995, 6:292-300.",
    "keywords": [
      "软件工程，面向对象，软件自动化．"
    ],
    "abstract": "本文对软件工程方法学发展各个阶段主要的方法论做了简单的评述，并展望了软件工程今后发展的方向，同时举例说明了以此为指导思想进行软件自动构造的方法．"
  }
]